In [27]:
import pandas as pd
import numpy as np

In [6]:
qw={'one':[1,2,3,4,5],'two':[6,7,8,9,10],'three':[11,12,13,14,15]}
df=pd.DataFrame(qw)
df

   one  two  three
0    1    6     11
1    2    7     12
2    3    8     13
3    4    9     14
4    5   10     15

In [7]:
del df['three']
df

   one  two
0    1    6
1    2    7
2    3    8
3    4    9
4    5   10

In [8]:
df.pop('two')
df

   one
0    1
1    2
2    3
3    4
4    5

In [9]:
df.axes

[RangeIndex(start=0, stop=5, step=1), Index(['one'], dtype='object')]

In [11]:
df.dtypes

one    int64
dtype: object

In [12]:
df.shape

(5, 1)

In [13]:
df.empty

False

In [40]:
qw={'one':[1,2,3,4,5],'two':[6,7,8,9,10],'three':[11,12,13,14,15]}
fd=pd.DataFrame(qw)
fd

   one  two  three
0    1    6     11
1    2    7     12
2    3    8     13
3    4    9     14
4    5   10     15

In [41]:
fd=fd.reindex(index=[0,3,2,1,4])
fd

   one  two  three
0    1    6     11
3    4    9     14
2    3    8     13
1    2    7     12
4    5   10     15

In [42]:
fd=fd.reindex(columns=['three','one','two'])
fd

   three  one  two
0     11    1    6
3     14    4    9
2     13    3    8
1     12    2    7
4     15    5   10

In [43]:
fd.rename(columns={'one':'five'},index={0:5})

   three  five  two
5     11     1    6
3     14     4    9
2     13     3    8
1     12     2    7
4     15     5   10

In [44]:
def add_(i,j):
    return i+j
def mean_(col):
    return col.mean()

In [45]:
fd.pipe(add_,10)

   three  one  two
0     21   11   16
3     24   14   19
2     23   13   18
1     22   12   17
4     25   15   20

In [46]:
fd.pipe(mean_).pipe(add_,10)

three    23.0
one      13.0
two      18.0
dtype: float64

In [47]:
fd.apply(np.mean)

three    13.0
one       3.0
two       8.0
dtype: float64

In [48]:
fd.apply(lambda x:x.max()-x.min())

three    4
one      4
two      4
dtype: int64

In [49]:
fd.applymap(lambda x:x*10)

   three  one  two
0    110   10   60
3    140   40   90
2    130   30   80
1    120   20   70
4    150   50  100

In [50]:
fd.groupby('one').groups

{1: [0], 2: [1], 3: [2], 4: [3], 5: [4]}

In [53]:
fd.groupby('one').get_group(2)

   three  one  two
1     12    2    7

In [54]:
fd.sample()

   three  one  two
3     14    4    9

In [55]:
fd.sample(3)

   three  one  two
1     12    2    7
0     11    1    6
4     15    5   10